[{ "jobTitle": "DevOps Engineer", "companyName": "Semcon Sweden", "companyLocation": "Kommun: Stockholm", "jobDescription": "At Semcon, we believe that the one who understands the end-user best, will create the best solutions. Therefore for us, it’s always people first. Then technology.\n\nNow we are looking for a DevOps Engineer with drive and warmth to join us. A person who thrive in a setting where a lot of things are going on. You will focus on facilitate coordination and collaboration among operations, development and testing functions.\n\nYou will be part of our growing Digital Services team and work together with kind and skilled individuals in challenging assignments and with exciting customers. In our division we all come from different areas of expertise and our ambition is to build a large team with skills ranging from digital strategy, project management and UX/service design to software development and emerging tech. We also have a long history of working with embedded software to create connected and smart products.\n\nWant to learn more about our offerings and projects within the Digital Services area? Click here. (https://semcon.com/sv/digital-hubb/)\n\nWhat you’ll do\n\n- Support in-house teams and customers improving their SW development workflow and getting the most out of their CI/CD environment\n- Bridge the gap and improve collaboration between operations, developers and testing functions\n- Troubleshoot issues with tools, processes, applications and/or infrastructure\n- Evaluate current development and operations procedures, recommend and implements tools and practices to increase efficiency and reliability\n- Having fun!\n\n\nWe’ll look beyond your resume, but here is a starting point.\n\n- Solid experience developing, testing and deploying software systems\n- Previous experience from working with some of the tools that make a state-of-the-art CI/CD environment (e.g. Azure/AWS, Jenkins, Python, Ansible, Kubernetes, Docker, Linux, Gitlab, Bitbucket).\n- Enjoy working with new technology\n- Excellent knowledge of agile methods\n- Great communication skills in Swedish and English.\n\n\nWe strongly believe that diversity of background, experience and perspectives is important to create excellent user experiences and to make Semcon a great place to work.\n\nIf you are interested in joining our team, just apply with your CV or LinkedIn below, or contact Tran to learn more!\n\nTran Cam\ntran.cam@semcon.com\nTeam Manager Digital Services", "jobPublished": "Publicerad: 27 januari 2022, kl. 14.18" }, { "jobTitle": "DevOps Engineer", "companyName": "Quinyx", "companyLocation": "Kommun: Stockholm", "jobDescription": "Do you want to help us unleash the secret to how happy employees create a happy business? We are an innovative, agile and continuously growing tech company on a path to improve the work lives of millions around the world.\n\nWe develop workforce management solutions - a software that makes scheduling and time reporting more smooth and flexible for close to a million users across the world.\n\nAre you curious and ready to take the first steps on an awesome journey and make magic happen with us? As a member of the Quinyx family, you will be part of an inclusive and diverse workplace, where you are allowed to be yourself and thrive.\n\nAbout the role\n\nYou will join our fantastic DevOps team focuses on performing best practices related to continuous deployment such as scaling, optimising the system, helping out with troubleshooting complex issues and operating code in AWS. Moreover, you will get to work with very passionate colleagues across the organisation who are all working together to create the leading SaaS AI-Driven Workforce Management system.\n\nWhat you’ll be doing\n\n\n\n Making sure our infrastructure can handle Quinyx’s rapidly growing number of users during our global expansion;\n\n\n\n\n\n Extending and strengthening the DevOps team with an innovative mindset providing new perspectives and ideas;\n\n\n\n\n\n Supporting the growing R&D department demanding state of the art tooling and infrastructure;\n\n\n\n\n\n Deliver a platform that is flexible, cost-efficient, secure, compliant and resilient;\n\n\n\n\n\n Provide tools that enable everyone to work and deliver in a fast, productive and simple way;\n\n\n\n\n\n Proactively prioritise problems and areas of improvement;\n\n\n\n\n\n Take full ownership of solving problems in an innovative way;\n\n\n\n\n\n Design, deploy and maintain log-pipelines, CI/CD tools/pipelines, AWS config, Kubernetes Clusters and Terraform configuration;\n\n\n\n\n\n Support development teams building, running and monitoring applications.\n\n\n\nWhat you’ll bring to the team\n\n Passionate about finding, implementing and communicating simple solutions to complex problems;\n\n\n\n Excellent in communicating technology with all parts of the organisation;\n\n\n\n Highly driven by the will to help people around you;\n\n\n\n Experienced with modern Cloud technology stacks and DevOps tools and love staying up to date with the community;\n\n\n\n Experienced in working with Go or Python.\n\n\n\n A positive and can-do attitude.\n\n\n\nWhat’s in it for you?\n\nWe promote and encourage a healthy lifestyle with flexible work hours and the latest tools, enhanced vacation allowance, gym membership contribution, virtual yoga classes, and last but not least, you will have the chance to participate in our well-known yearly ping-pong tournament!\n\nLife at Quinyx\n\nWe are an innovative, agile and continuously growing modern tech company. We value passion, creativity, quality and simplicity. You’ll be given the opportunity to make an impact and directly contribute to our success, bring new ideas and have full ownership of your area.\n\nOur global team, of 30 nationalities, have fun together whether it is during a typical Swedish Fika, workshop, going for a run with a colleague or spending time together during the annual company Goal trip, team kickoffs, or after-work socials. We have built a family atmosphere here at Quinyx and are committed to sharing knowledge and supporting one another!\n\nWant to join the family?\n\nAt Quinyx, we provide equal employment opportunities and we strive to have an inclusive and diverse value-driven culture. All applications will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, disability or veteran status.\n\nHappy Workforce, Happy Business!", "jobPublished": "Publicerad: 26 januari 2022, kl. 17.22" }, { "jobTitle": "DevOps Engineer", "companyName": "Cubane Solutions AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "Must-have:Experience in deploying and configuring infrastructure on Private Cloud(s).Familiarity in Redhat Linux administrationExperience in Ansible, Python, GitBasic understanding of MariaDBWorking experience from PrometheusBasic knowledge of XML and JSONBackground in working with REST integration and messaging platforms such as Apache KafkaExperience in working according to agile, scrum, or SAFe principlesKnowledge from working in CI/CD pipelinesUniversity degree in Computer Science or equivalent Language:English (Fluent in both spoken and written)Öppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.", "jobPublished": "Publicerad: 19 januari 2022, kl. 13.37" }, { "jobTitle": "DevOps Engineer", "companyName": "iopsys software solutions AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "Do you think containers and micro architectures are here to stay? Then this might be your opportunity! Come add value to IOPSYS Software Solution’s growing development team as our DevOps Engineer Do you think containers and micro architectures are here to stay, have you been involved in container infrastructure projects, and you know that it is more than just a technology shift? Do you continuously look for ways to automate repetitive tasks and provide self-service solutions.IOPSYS is building a new Infrastructure Engineering Experience to help us supply the best practical solution for development and testing of our products. The infrastructure team will supply tools and process alignment to allow the rest of our engineers do their jobs as smoothly as possible. The role:· Your main responsibility will be to provide stable and reliable infrastructure baselines for the Development and Test teams in collaboration with IT. . You will supply support for the common environments used by Development and Test teams and continuously develop them to smoothen the delivery pipelines.· You should support the Development teams to grow and deliver healthy software by facilitating tools and process alignment·  You will help and support developers and testers through training, mentoring and problem solving, continuously looking for improvements to ensure high standards of automation of all internal infrastructure. Required skills·  4+ years’ experience in DevOps or related field.·  Experience in working in Linux/Unix systems as well as interacting with continuous integration tools like Jenkins, Gitlab· Python skills. General network and wireless knowledge: WLAN, TCP/IP, Firewall·  Experience with Git·  CI/CD developments discipline experience·  Docker, Kubernetes or other relevant container technologies· Particularly good English skills in speaking and writing What about you?. You have good priority skills and judgement of situation urgency. You are able to use analytical skills and independent judgement in designing software infrastructure· You enjoy a culture of trust, collaboration, and diversity . You want to have a sustainable workload and a fine balance between work and leisure. Good interpersonal skills and ability to collaborate with othersWho are IOPSYS? Our vision is to realize the digital home!Our belief is that the Wi-Fi gateway is an increasingly important part of the smart connected home and we support the vision by being a key player that transforms and brings the open-source business model to the gateway industry. Maintain leadership in development and offer supported versions of enterprise software for the gateway industry.   IOWRT is one of the most advanced, platform independent gateway software based on Openwrt*. We embrace open-source and contributes code to other open-source projects which enables IOPSYS' developers get recognition for their work not only at IOPSYS but also in the wider community. We are located close to Mariatorget in Södermalm, Stockholm.", "jobPublished": "Publicerad: 12 januari 2022, kl. 15.05" }, { "jobTitle": "DevOps Engineer", "companyName": "ELITS ", "companyLocation": "Kommun: Stockholm", "jobDescription": "Vårt erbjudande\n\nELITS kan erbjuda dig ett utmanande och varierande jobb som konsult med stora personliga utvecklingsmöjligheter! Vi satsar hårt på kompetensutveckling och att ständigt hålla oss i teknisk framkant.\n\nHos  får du utvecklas tillsammans med duktiga och erfarna kollegor som har arbetat med Openstack, Kubernetes, containertekniker och cloud native i flera stora och utmanade projekt de senaste åren. Våra kunder är nationella och globala både medel och stora bolag.\n\nVi har intressanta, långsiktiga uppdrag och team-leveranser där du kan utvecklas och arbeta nära kollegor som delar din passion för teknik\n\n\n\nSom anställd på ELITS får du ett antal fördelar som:\n\n- En trygg och säker anställning\n- Individuellt anpassad utvecklings- och utbildningsplan\n- Friskvårdsbidrag\n- Privat sjukvårdsförsäkring\n- Privat pensionsrådgivning\n- Förmånsportal\n- Extremt kompetenta och skickliga kollegor\n\n\nOm rollen:\n\nFör långsiktiga uppdrag och team-leveranser till våra kunder letar vi nu efter flera DevOps kollegor för att vara en del av vårt skickliga och snabbt växande Devops-team!\n\nSom anställd på ELITS får du upplevaia av det bästa från två världar; delvis kundmiljöerna, men också ELITS som arbetsgivare där du är med och formar vår stora företagskultur och delar kunskap och erfarenheter med andra likasinnade.\n\nDu kommer också att erbjudas utbildning, kompetensutveckling och certifieringar tillsammans med våra tekniska partners där vi arbetar tätt tillsammans med Redhat, Suse/Rancher, Hashicorp och Styra .\n\nVåra konsultuppdrag innebär ofta att vi hjälper våra kunder i modernisera deras IT-miljöer, att hjälpa dem arbeta mer agilt och på ett modernt sätt med rätt typ av verktyg för att på bästa sätt stötta deras nuvarande och framtida behov. Detta gör vi enligt en metodik vi på ELITS kallar Journey to Agile.\n\n\n\nFör att passa in i rollen tror vi att du har erfarenhet av följande:\n\n- Systemadministration i en Linux-baserad produktions-miljö\n- Container-infrastruktur (Docker, Kubernetes)\n- Scriptning/programmering i språk som Bash, Python, Go\n- Versionshantering - Git\n- Automatisering\n\n\nMeriterande om du även har kunskap inom:\n\n- IaC - Ansible, Terraform\n- CI / CD\n- Openstack\n- Publika clouds\n- Openshift och/eller Rancher\n- Hasicorp: Vault, Consul, mfl\n\n\n\n\nFör att trivas i rollen som konsult bör du ha lätt att skapa relationer, kunna arbeta både i team och självständigt och ha stor personlig drivkraft och lösningsfokus.\n\nÄr du en social, flexibel och strukturerad person med stort intresse inom av arbeta med och att utvecklas inom de senaste teknologierna så tror vi du kommer passa in och trivas utmärkt hos oss!\n\nFör denna position utförs även bakgrundskontroll av slutkandidat.\n\n\n\nOm du har frågor om rollen eller våra uppdrag, tveka inte att kontakta mig på det sätt som passar dig bäst, chatta, maila eller ring!\n\nlinus.berglund@elits.com, 0733-590 205.", "jobPublished": "Publicerad: 3 januari 2022, kl. 08.44" }, { "jobTitle": "DevOps Lead", "companyName": "EMQ Sweden AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "At EMQ we are building the future of IoT data infrastructure. We launched on GitHub in 2013, as an open-source project and has since then become the most popular open-source MQTT message broker. Since the establishment in 2017, EMQ is catering our customers and users in over 50 countries around the world. AT EMQ we constantly challenge ourselves to go further and do better in supporting enterprise customers by supplying massive-scale and solid solutions. EMQ Technologies is headquartered in Hangzhou, China and R&D headquarter is in Stockholm, Sweden\n\nOur stories are to be told, and knowledges to be shared for greater success of our customers and the IoT industry.\n\nWe are looking for our first DevOps Lead to join our team in Stockholm!\n\nYour future role\n\nYou will play a vital part in our Product & Tech team. As DevOps Lead you will be in the driver seat for our cloud-native solutions. As a DevOps Lead your mission will be to build the OPs team in Europe and be responsible for enabling and helping the technical team to build and deliver cloud-native products. You will be responsible for implementing and advocating modern DevOps and OPs practices. You will work closely with the tech and engineering team and have the opportunity to help develop best-in-class cloud-native solutions and have an influence on large parts of the technical infrastructure and architecture for those solutions. In addition, you will work with supporting our users with their deployment.\n\nSome of your responsibilities will be, but not limited to:\n\n- Being the driving force and lead the thinking of cloud-native solutions\n- Help build, test, and maintain our cloud-native products\n- Develop Kubernetes operators and Terraform modules\n- Create technical documentation\n- Develop CI pipelines\n\n\nWho you are\n\nTo succeed in this role, we believe you are passionate, courageous, and curious with a business-oriented mindset. You are always up-to-date and love discovering new and modern technologies and ways of working for constant development. You have excellent communication skills since you will be interacting with both internal and external stakeholders. Furthermore, you enjoy achieving results together with the team and have a positive attitude toward problem solving.\n\n- Minimum 2 years proven work experience in DevOps or similar role\n- Proficient in Bash and Python scripting languages\n- Experience in CI/CD tools, preferably Terraform & Ansible\n- Solid understanding of Linux system and container technologies\n- Excellent English skills, both written and verbal\n\n\nWhat we offer\n\nWe offer you the opportunity to work in a growing and fun company in a versatile role where you will have the chance to develop and make your voice heard.\n\nEMQ Sweden is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\n\nYour application\n\nIf you have any questions, please feel free to contact Rebecca Josefsson at Rebecca.josefsson@emqx.io or at +46726601868\n\nWelcome with your application today!", "jobPublished": "Publicerad: 20 december 2021, kl. 15.17" }, { "jobTitle": "DevOps Engineer", "companyName": "Svenska Spel", "companyLocation": "Kommun: Solna", "jobDescription": "Ta chansen att jobba med Svenska Spels avancerade systemmiljö. Vi jobbar i till stor del egenutvecklade system och hanterar ett av världens mest avancerade spelsystem. Just nu arbetar vi med ett nytt stort och spännande projekt som syftar till att portera hela vårt transaktionssystem till en helt ny plattform. Vill du vara med på den resan? Sök idag!\n\nVad kommer du att göra?\n\nSom DevOps Engineer i Core Services blir du en del av CoreOps-teamet där du får möjlighet att jobba med utveckling, bygg och deployment samt runtime-miljöer för våra transaktionssystem. Systemen är komplexa och hanterar dagligen miljontals transaktioner som förstås ställer höga krav på kvalitet och prestanda. Vi arbetar med teknik i framkant och ger dig möjlighet att arbeta med nya, spännande lösningar varje dag.\n\nI rollen som DevOps Engineer jobbar du och utvecklarna tillsammans med våra utvecklings-, bygg- och deploymentmiljöer. Du ansvarar för och assisterar kring releaser av domänens komponenter och levererar dem med övervakning och mätvärden. Du fungerar som bollplank och support vid behov av ny hårdvara, nätuppsättning och brandväggsöppningar i projekt som teamet deltar i.\n\nJust nu arbetar vi med nästa version av vårt transaktionssystem som bland annat inkluderar operativsystemsbyte och övergång till 24/7-drift. Du blir en nyckel i bytet till Linux-plattform och ansvarar tillsammans med teamet för att ta fram de förutsättningar som krävs avseende utvecklings-, bygg- och deployment-miljö för den nya transaktionsplattformen.\n\nÄr du den som kommer att göra det?\n\nSom person är du självständig, har en stark analys- och problemlösningsförmåga och trivs allra bäst som en del av ett sammansvetsat team.\n\nDu har en bred bakgrund som systemutvecklare, systemtekniker eller integrations- och utvecklingsnära testare. Har djupa kunskaper och flerårig erfarenhet av Linux. Du har arbetat med orkestreringsverktyg så som Ansible, Puppet eller SaltStack samt scriptspråk som Python eller Bash. Du behärskar svenska flytande i tal och skrift.\n\nDet är meriterande om du tidigare jobbat med transaktionsintensiva system med krav på hög tillgänglighet och har erfarenhet av tekniker och tjänster som MongoDB, ScyllaDB, ELK, Grafana, Prometheus samt Jenkins.\n\nOm Tech på Svenska Spel\n\nPå Svenska Spel hanterar vi 10 000 000 transaktioner varje dag, året runt och på sex dagar har vi hanterat samma transaktionsvolym som den största pengaöverföringsappen gör på en månad. Varje dag utvecklar, driftar och supportar vi ett av världens mest avancerade spelsystem, vi är med andra ord ett techbolag som sysslar med spel - inte tvärtom. Och som ett techbolag som sysslar med spel kommer ett ansvar, både för folks drömmar och spänning, men även för deras spelande. Det är också därför du kommer märka att vårt spelansvarsarbete genomsyrar hela företaget från första dagen du börjar jobba hos oss.\n\nVi är Svenska Spel\n\nVi är modiga, nyfikna och vi strävar efter enkelhet i allt vi gör. Vi vill att spel ska vara till glädje för alla - för våra medarbetare, kunder och gäster, för idrotten och för samhället i stort. Vi sponsrar idrottsrörelsen på alla nivåer, förebygger spelproblem och låter vinsten gå tillbaka till samhället.\n\nAnsökan och kontaktuppgifter\n\nTjänsten är en tillsvidareanställning med placering i Solna med möjlighet till flexibelt distansarbete. På Svenska Spel utför vi jobbet där det passar bäst - ibland är det hemma och ibland på kontoret.\n\nVi utför intervjuer och urval löpande så skicka in din ansökan så snart som möjligt.\n\nFör frågor om tjänsten, kontakta Maria Devallius, Chef Core Services, maria.devallius@svenskaspel.se\n\nFör frågor om rekryteringsprocessen hittar du information  här (https://career.svenskaspel.se/pages/rekrytering-pa-svenska-spel?utm_campaign=page_130226_cta_4969676&utm_content=https%3A%2F%2Fcareer.svenskaspel.se&utm_medium=cta-block&utm_source=teamtailor-page). Eller så kan du alltid kontakta vårt TA-team på teamta@svenskaspel.se.", "jobPublished": "Publicerad: 9 december 2021, kl. 09.12" }, { "jobTitle": "DevOps Engineer", "companyName": "Squeed", "companyLocation": "Kommun: Stockholm", "jobDescription": "Vi på Squeed är ett innovativt IT-konsultbolag där du får chansen att jobba i intressanta uppdrag med nya tekniker. Om du söker ständig utveckling och möjligheter till att lära dig nya saker är Squeed helt rätt bolag för dig! Här prioriteras kompetensutveckling högt och är en stark del av företagskulturen.\n\nJust nu söker vi efter erfarna DevOps-ingenjörer till vårt kontor i Stockholm. Vill du vara med i vår gemenskap och växa tillsammans med oss?\n\nPå Squeed kommer du att:\n\nPå Squeed drivs vi av våra passioner. Tillsammans skapar vi fantastiska lösningar och ser till att dela vår kunskap med varandra. Hos oss kommer du hitta duktiga kollegor och möjligheten till att engagera dig i saker som du brinner för. Eftersom kunskapsdelning är en stor kärna i vår verksamhet sker kompetensutveckling på arbetstid där du tillsammans med dina kollegor kommer driva er kunskapsdelning framåt.\n\nSom DevOps Engineer hos oss kommer du ha en omväxlande roll där du kommer stötta våra kunders resa inom DevOps utifrån deras mognadsgrad. Christofer berättar mer om hur han upplever rollen:\n\nAtt jobba med DevOps är både utmanande och kul! På mitt uppdrag har vi en stor skara användare vars olika behov ska uppfyllas samtidigt som vi pumpar ut byggen i flera olika konfigurationer på löpande band. Man lär sig något nytt varje dag och vi har väldigt engagerade användare, vilket både driver och motiverar mig till att göra deras vardag enklare.\"\n\n\nVem är du?\nVi tror att du är en kommunikativ person som drivs av att lära dig nya saker. Automatisering är ett ord som får ögonen att tindra och det är en självklarhet för dig att hålla slutanvändaren i fokus. För att lyckas i rollen tror vi att du har:\n\n- En relevant utbildningsbakgrund\n- 3 år + av relevant arbetslivserfarenhet\n- Professionella kunskaper i svenska och engelska\n\n\nVi ser också gärna till att du har:\n\n- Erfarenhet av scriptspråk som Python, Bash och/eller Powershell\n- Kunskaper inom molnlösningar och containeriserings-verktyg\n- Erfarenhet av monitorering och CI/CD-tekniker\n- Förespråkar infrastructure-as-code i ditt arbete\n\n\nMer om oss på Squeed:\n\nVår resa började för ca 10 år sedan med fem utvecklare som ville skapa en annorlunda arbetsplats - där passion stod i centrum. Sedan dess har vi växt från 5 passionerade utvecklare till cirka 80 där du kan hitta oss i Stockholm, Göteborg och Oslo. I Stockholm är vi idag runt 20 Squeeders som ser fram emot att få fler härliga kollegor till vårt kontor. Vår erfarenhet är bred och bransch-överskridande. Du hittar oss inom ett flertal branscher som bland annat omfattar fordon, aviation, läkemedel, telekom, finans, sjukvård och transport.\n\nÄr du redo att ta ditt nästa steg och bli en Squeeder?\n\nSkicka in din ansökan redan idag!", "jobPublished": "Publicerad: 7 december 2021, kl. 08.30" }, { "jobTitle": "DevOps Engineer", "companyName": "DEK Technologies", "companyLocation": "Kommun: Stockholm", "jobDescription": "Are you a driven and self-motivated engineer with experience in DevOps? Do you thrive in international environments where cooperation and personal development are highly valued? Join us on our journey towards developing tomorrow's technology!\n\nWe are currently expanding and now looking to hire an experienced DevOps Engineer that is ready to join our DEK-family. As a DevOps engineer at DEK Technologies, you will work for one of our customers within MedTech. This assignment includes working in a team that is focused on develop embedded software for ventilators and respirators. As a DevOps engineer your tasks will be focused on improving the developer’s processes, responding to and giving faster feedback on codes, providing automation. The role also includes managing infrastructure, suggesting branch strategies, handling build nodes, maintaining services like Jenkins & SonarQube, and working with services like Github, Artifactory and Azure. It is required that you have good team skills and support others with providing infrastructure that enables faster feedback loops on the product development. The goal is to provide automation in the areas of building and testing. The opportunities for growth and personal development are considerable, limited only by your own drive and curiosity.\n\nKey qualifications for the position:\n\n- BS or MS in computer science, software engineering or similar, alternatively equal knowledge acquired through working experience\n- At least 3 years of experience in DevOps engineering and a general understanding of CI/CD strategies\n- General knowledge of Linux system administration\n- Extensive knowledge of Python and Bash\n- Strong understanding of git and branch strategies\n- Docker and Kubernetes\n- Jenkins experience\n- Preferably experience in working with Azure devops\n\n\nWho are you?\n\nTo be successful in this position we believe it is important that you are an ambitious person with a strong inner drive. You are a team player with great communication skills who enjoys working together with your colleagues. Since we are a flat organization working according to Agile methods, we expect you to be self-motivated with the ability to organize your daily work.\n\nAbout DEK Technologies\n\nDEK Technologies is a technical consultant company with a flat organization aiming to develop proactive and creative solutions. We have no hierarchical structures striving to stay this way by using agile working methods. At DEK Technologies you will find collaborative and empowered engineers with the ability to self-organize and create innovative solutions.\n\nWhy work at DEK Technologies?\nWe can offer you an inspiring Agile environment with great possibilities where your personal development and growth are just as important as our business. At DEK Technologies we work in goal-oriented teams which are mostly placed in-house. You will work alongside your development team but there’s also a possibility for you to go work abroad. We offer all our employees creative time where you are given the opportunity to use working hours of your time to expand your knowledge and continue to develop through self-controlled projects.", "jobPublished": "Publicerad: 6 december 2021, kl. 17.48" }, { "jobTitle": "DevOps Engineer", "companyName": "DigitalRoute", "companyLocation": "Kommun: Stockholm", "jobDescription": "The world is changing in the way we consume products, from ownership to usership, and DigitalRoute is positioned in the centre of the transition. Because, when enterprises pivot to usage-based business models, they often make an unfortunate discovery. Their systems weren’t built to handle the massive data volumes and complexity that usage-based models generate. This causes them to leak revenue and respond too slowly to customer demand. DigitalRoute solves this by creating a real-time usage data layer for enterprises. Our products transform raw usage data into clear information for billing, in real-time and at a high scale. \n\nWe are now looking for a talented Senior DevOps Engineer that wants to participate in building our success story.\n\nAt our office, located in the center of Stockholm. We promote self-organizing cross-functional teams, a flat hierarchy and flexible working hours to give all our employees a good work/life balance. Because of our large customer base, each with a different set of requirements, there is always a new challenge and you will most certainly find projects that align with your passions. \n\nWhat you'll do\n\n - Perform daily operations for all our hosted solutions \n - Own, manage, tune and continuously improve all monitoring applications on Cloud products\n - Design, build and maintain DevOps specific tools\n - Architect, design and implement a highly scalable and reliable infrastructure on a Cloud solution\n - Perform releases for Cloud products to the production environment\n - Maintain and manage CI/CD pipelines\n - Provide 24x7 support for Cloud products\n - Proactively work with life cycle management and outage prevention\n - Serve, Educate, and share knowledge with our local and distributed development teams so they can own their infra and code changes\n\nWhat you'll bring\n\n - Have proven DevOps experience \n - Have ability to code, test, build, deploy, etc.\n - A solid experience in terms of building and running scalable solutions in the Cloud. (Kubernetes expertise and AWS)\n - Have experience and worked with related tools, ie Git, Docker, Kubernetes, Ansible, Terraform, Helm, Jenkins, DataDog, Jira, Confluence\n - Have set up and operated services by measuring and monitoring availability and performance\n - A team player mindset, comfortable with collaboration, open communication and reaching across the functional borders\n - Love for solving problems with scripting like python, shell, Node.js \n - Are an adaptable and pragmatic problem solver\n - The willingness to learn more!\n\nThe role is located in Stockholm, Sweden \n\n\nDigitalRoute has the only platform that is purpose built to convert raw usage data into billable items. This enables companies to capitalize on the growing wave of usage-based business models. More than 400 companies rely on our platform for usage-based monetization, quote-to-cash automation, finance system consolidation and telecom mediation. We deliver extreme precision in the most complex environments in the world. We’re the new standard for usage-based revenue.", "jobPublished": "Publicerad: 29 oktober 2021, kl. 10.00" }, { "jobTitle": "DevOps Engineer", "companyName": "GpsGate", "companyLocation": "Kommun: Stockholm", "jobDescription": "Gpsgate\n\nWe build vehicle tracking software that powers fleet management businesses around the world. We help fleet owners improve fleet efficiency, keep drivers safe, and reduce their environmental impact. Our goals: end users love GpsGate, our resellers grow their businesses, and we have fun doing it.\n\nThe role\nWe are looking for a DevOps Engineer with previous experience in a leading DevOps role. You will work closely with our lead engineers to build, manage and automate our AWS infrastructure. You have technical depth and hands-on implementation experience from tools in the DevOps toolchain.\n\nAt GpsGate, you’ll join a growing team that is full of energy. We emphasize knowledge-sharing and teamwork, so you get to work closely with your talented colleagues.\n\nWhat you'll do\n-  Design and manage a cloud infrastructure for GpsGate Server that is secure, scalable, and highly available on AWS\n- Work collaboratively with our architects to define infrastructure and deployment requirements\n- Provision, configure and maintain AWS cloud infrastructure defined as code\n- Troubleshoot problems across a wide array of services and functional areas\n- Build and maintain operational tools for deployment and monitoring\n- Perform cost analysis and optimization of AWS resources\n- Implement CI/CD workflows in AWS\n- Work with a broad range of AWS services such as MSK, Keyspaces, Aurora, ECS Fargate, S3, Lambda, EC2 and many more\n\n\nWho you are\nTo succeed at GpsGate, we believe that you are passionate about helping our customers succeed. You take pride in your work. You enjoy working closely with colleagues and the fast pace that comes with a smaller company. You’re eager to take on a leading role defining our cloud infrastructure.\n\nWe’re looking for a DevOps engineer with:\n\n- Experience automating cloud native technologies, deploying applications, and provisioning infrastructure\n- Containerizing existing and new applications and services\n- Hands-on experience with Infrastructure as Code, using CloudFormation/CDK\n- Experience developing cloud native CI/CD workflows using tools like AWS CodePipeline\n- Hands-on experience with microservices and distributed applications\n- Experience in VPC designs and architecture\n- Experience managing both Linux and Windows OS\n\n\nRequirements\n- At least 3-5 years of experience building and maintaining AWS services\n- Bachelor’s or master’s degree within Computer Science or related field\n- Fluency in both written and spoken English\n\n\nWhy GpsGate\nAt GpsGate, you have real impact. Our software helps companies worldwide in their day-to-day business managing deliveries, cutting fuel emissions, ensuring the safety of their staff, and much more.\n\n- Have the freedom to try out new things, find smarter ways to work with your team, and identify innovative solutions\n- Join a diverse team with multinational colleagues\n- Grow as a DevOps specialist in an expanding company\n\n\nAnd of course, we also have great benefits:\n\n- Competitive salary\n- Flexible work policy\n- 30 days paid vacation\n- Annual company conference and local office outings\n- Friskvårdsbidrag/ health & fitness allowance\n- Private health insurance\n- ITP (pension retirement savings)", "jobPublished": "Publicerad: 27 oktober 2021, kl. 16.45" }, { "jobTitle": "DevOps Engineer", "companyName": "GOALS", "companyLocation": "Kommun: Stockholm", "jobDescription": "Do you have a dream of doing something truly revolutionary in gaming? Do you want to work in a studio with great vibes where you have a voice? Do you want everyone to feel included? Come work with us at GOALS!\n\nWe have just started building our dream game and are looking for a DevOps Engineer. We have a genuine ambition to make something that is more than a game. In the GOALS universe games exist both on and off screen, blending football, fashion, esports and digital assets.\n\nFocus Areas\nAs a DevOps Engineer you will help us with the infrastructure and workflow for how we build, deploy and manage our game tech development. Together with stakeholders, you will provide the core infrastructure, tools and necessary support to enable the development team. You are not only expected to maintain the environment but we want you to continuously improve it.\n\nWe think you have some years of experience as a DevOps- or Build Engineer and that you like collaboration and giving support. We expect you to know the state of the art but we also want you to challenge existing best practices and you love to find improvements to processes and automate things in general.\n\nQualifications\n\n- Jenkins CI/CD workflows or equivalent\n- Plastic SCM, Perforce, Git or equivalent experience.\n- Experience with at least one scripting language and one programming language.\n- Monitoring tools such as DataDog, Grafana, etc.\n- Kubernetes\n- Have worked with at least one cloud provider and have experience with deploying servers off-site.\n- Self-motivated, strong work ethic, able to work independently\n- Strong communication skills - must possess excellent English verbal and written communication skills.\n- The ability and desire to work in a team, often with different disciplines.\n\n\nIt would be a bonus if you also have experience in\n\n- Game development\n- Unreal Engine\n- Writing bots for Discord\n- Steamworks\n\n\nAbout the Employment\n\nThe position is permanent, starting with 6 months of probationary employment. You can work from our Stockholm office, fully remote or hybrid. It is important that you are able to communicate unhindered in verbal/written English and that you can work in a timezone close to Stockholm (GMT 0-3 hours).\n\nHow to Apply\n\nGOALS is all about dreams coming true! We are willing to take chances. Do you have the passion but do not tick all the boxes? Apply anyways!\n\nPass your application by submitting your profile.\n\n_______________________________________________\n\nOur values\n\nAt GOALS we empower people, from our team to our community. We empower the game creators. As part of the team your enthusiasm, creativity and voice matter and is reflected in this extraordinary game. We empower diversity. We believe in a space where we drive for change and equality together, throughout our organization, game and industry. We empower flexibility. As an inclusive and international company, we welcome remote work and flexible work hours.\n\nAbout the Studio\n\nGOALS is a small start-up with big dreams!\n\nHumble in the way we work; embracing that skilled and passionate people are the heart and core of our studio. Not humble in our objective; creating the best football game in the world.\n\nRecognizing there wasn’t a fast paced, competitive, multiplayer focused football game on the market we decided to change that. Let’s bring football into esports for real! Bridging the gap between the real world and the digital, we’re building something that is more than a game.\n\nOur community is the most important voice, and we want to give every colleague and gamer a feeling of ownership.", "jobPublished": "Publicerad: 19 oktober 2021, kl. 15.15" }, { "jobTitle": "Experienced DevOps Engineer", "companyName": "Alten Sverige AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "Hi! Are you interested in working at one of Sweden’s most attractive employers?\n\nALTEN IT Stockholm is growing, and we are now looking for a DevOps Engineer for an exciting project. Would you like to be a part of our development teams, consisting of a highly inclusive mix of skilled Frontend-and Backend developer, DevOps Engineers, iOS/Android developers and Cloud Architects from all over the world? Also, get the opportunity to be led by our dedicated management team who will guide you forward in your career? ALTEN IT Sweden has 200+ assignments and we are approximately 100 employees within IT at the Stockholm offices, working inhouse or at different projects. We all come together during tech week or in our internal competence networks such as \nWOMEN@ALTEN, ALTEN INNOVATION AND ALTEN SPORTS.\n\n\nWE THINK OUR NEW COLLEAGUE HAS:\n• 3+ years experience of software development\n• Experience within CI/CD and Microservices\n• Work experience with Docker/Kubernetes\n• Cloud experience\n\nMERITORIOUS IF YOU HAVE EXPERIENCE/KNOWLEDGE WITHIN:\n• Scripting languages such as Python, Bash or Go\n• Git/Jenkins/Gerrit\n\nWE OFFER\n- National and International opportunities – A wide range of assignments both locally and globally\n- Internal Networks – Creating togetherness between colleagues\n- Individual education budget – For further personal development\n- Work life balance\n- Other benefits regarding wellness, health care and pension\n- Fully paid between assignments and collective agreement\n\nOur clients are found in industries such as vehicles, telecom, finance, banking, public sector and retail, where our consultants are active throughout the product development chain. Every employee is equally important to our company growth and success, and therefore we value individual feedback and work actively with personal development. Today, ALTEN Group is based in more than 25 countries and is one of Europe’s largest consulting companies within IT, Engineering and Life Science, with over 37.000 employees.\n\nApply now and be a part of our amazing journey - \nWE BELIEVE IN GROWING TOGETHER!\n\nQUESTIONS?\nContact HR Partner Aida Finström at aida.finstrom@alten.se", "jobPublished": "Publicerad: 13 januari 2022, kl. 16.02" }, { "jobTitle": "DevOps Engineer, Luleå/Stockholm", "companyName": "Pensionsmyndigheten", "companyLocation": "Kommun: Stockholm", "jobDescription": "Pensionsmyndigheten är i teknisk framkant. IT-avdelningen har ca 450 medarbetare. Storleken behövs, bland annat för att möta kommande reformer i pensionssystemet för långsiktigt trygga pensioner. Vi står inför omfattande utveckling under många år med den senaste tekniken och med moderna arbetssätt. På IT-avdelningen möter du i en kultur med driv och hög ambitionsnivå, samtidigt som vi värnar om en sund balans mellan arbete och privatliv. Vår vision är att leverera bäst IT för Sverige.\n\nVi arbetar med Continuous Delivery, automatiserad testning och automatiserad konfigurationshantering. Vi har som ambition att automatisera vårt arbete redan från början för att undvika att behöva göra samma sak mer än en gång. Allt i linje med DevOps. \n\nVarje dag utvecklar och arbetar vi med innovativa tekniska lösningar för våra miljontals kunder runt om i landet. Här får du arbeta med de senaste tekniska innovationerna och samtidigt göra en insats för samhället  vårt jobb berör alla!\n\nI din roll som DevOps Engineer kommer du att ingå i ett, utav flera, agila, tvärfunktionella och självgående team som hantera alla delar av utvecklingskedjan. Vi jobbar i korta cykler och driftsätter ofta, enligt agila principer.\n\nI teamet kommer du att vara en central person och underlätta dina kollegors dagliga arbete genom att diskutera idéer, angreppssätt och lösningar. Du får många kunniga kollegor som gärna delar med sig av sin kunskap och erfarenheter och vi jobbar aktivt med kompetensspridning.\n\nIdag har teamet få tjänster i drift men detta kommer att växa över tid, i takt med att vi utvecklar framtidens pensionssystem. Initialt kommer därför dina arbetsuppgifter att kretsa mycket kring CI/CD pipeline, test-, utvecklings- och produktionsmiljöer, samt annan nödvändig infrastruktur och automatisering. Du kommer även att övervaka, felsöka och utföra installationer, samt ansvara för konfiguration och integration mot bakomliggande system.\n\nDet här är några av de tekniker vi arbetar med:\n\n Docker / Openshift / Kubernetes\n Red Hat Linux\n Bash / Python\n Jenkins / Groovy\n Java / Maven / Springboot\n Git / Bitbucket\n Puppet / Ansible\n Elastic Stack / Grafana / Prometheus\n Nagios / Check_mk\nUtbildning och erfarenhet:\nVi tror att du antingen har en bakgrund som utvecklare, med erfarenhet och intresse av att jobba med systemadministration, eller som systemadministratör, med erfarenhet och intresse av att jobba med utveckling. Eller så jobbar du redan idag som en DevOps Engineer?\n\nVi ser att du har:\n god kompetens inom Linux\n erfarenhet inom programmering, gärna Java\n goda kunskaper i tal och skrift i såväl svenska som engelska\n\nKunskaper inom följande områden anses meriterande för rollen:\n arbetslivserfarenhet av ovan nämnda tekniker/system\n erfarenhet av att arbeta agilt, lean eller DevOps\n eftergymnasial utbildning inom IT\n\nEgenskaper:\nFör att trivas i rollen som DevOps Engineer hos oss är det viktigt att du som person har en god analytisk och problemlösande förmåga. Vidare ser vi att du är nyfiken, ansvarstagande och resultatorienterad. Självklart tycker du om att arbeta i team, har en god samarbetsförmåga och trivs med vårt klimat där kompetensspridning är en naturlig del i arbetet.\n\nVi har stort fokus på vår kultur och hur vi tillsammans påverkar vår arbetsplats, du bör därför ha ett intresse och vilja att vara med på denna kulturresa. Vår kultur andas DevOps och kan sammanfattas med tre ord: effektiva, kunniga och hjälpsamma.\n\nVi lägger stor vikt vid dina personliga egenskaper och lämplighet för rollen.\n\n\nÖvrigt:\nPensionsmyndigheten ansvarar för den allmänna pensionen och informerar om hela pensionen. Varje år betalar vi ut cirka 361 miljarder kronor till 2,3 miljoner pensionärer, genomför cirka 600 000 fondbyten och skickar ut 7,7 miljoner orange kuvert. Vi är drygt 1400 medarbetare på åtta orter.\n\nVi gör pensioner enklare!\n\nTjänsten är en tillsvidareanställning, vi tillämpar provanställning om 6 månader.\n\nDå anställningen är placerad i säkerhetsklass krävs svenskt medborgarskap. Säkerhetsprövning med registerkontroll enligt Säkerhetsskyddslagen (2018:585) kommer att genomföras innan anställning.\n\nVi strävar efter en jämn könsfördelning och ser mångfald som en styrka och välkomnar därför sökande med olika bakgrund.\n\nTjänsten kan placeras i Stockholm eller i Luleå. I Stockholm finns vårt kontor nära Hornstulls tunnelbana på Södermalm och i Luleå i närheten av Coop Arena. Vi har möjlighet till hybridarbete - att arbeta både på kontoret och på distans.\n\nFör mer information:\nFör mer information om tjänsten kontakta gruppchef Birgitta Steffensson via e-post till birgitta.steffensson@pensionsmyndigheten.se\n\nFackliga representanter:\nLiv Berntsson, Saco, tel. 010-454 34 19\nHelena Blomkvist, ST, tel. 010-454 28 53\n\n\nVarmt välkommen med din ansökan!\n\nInför rekryteringsarbetet har vi tagit ställning till annonskanaler och marknadsföring. Vi undanber oss därför ytterligare kontakt med media-/annonsförsäljare, rekyteringssajter och liknande.", "jobPublished": "Publicerad: 10 januari 2022, kl. 08.26" }, { "jobTitle": "DevOps Team Members", "companyName": "First Rent A Car Aktiebolag", "companyLocation": "Kommun: Solna", "jobDescription": "Att det är kunnig personal som skapar Hertz Sveriges framgång är ingen hemlighet. Bilarna är grunden i vår verksamhet, men det är medarbetarnas engagemang och omtanke som gör oss till det ledande hyrbilsföretaget vi är. \n\nHertz DevOps avdelning är ett ben inom Hertz Nordic IT och ska vara en del av organisationen som övriga medarbetare inte tvekar att kontakta. Där man upplever att man får ett professionellt och kompetent bemötande och där upplevelsen är att varje ärende hanteras med den prioritet och vård det förtjänar. Därför söker vi dig som är kundorienterad, engagerad och som vill fortsätta vara med och utveckla både våra tekniska miljöer samt våra medarbetares serviceupplevelse.\n\nDin roll\n\nSom DevOps medarbetare hos Hertz hjälper du användarna i våra interna nordiska och internationella system, mjukvara och hårdvara. Avdelningens fokusområden är 1st line support till användarna, systemadministration, registervård och underhåll. Vi ansvarar för 2nd line support och till viss del även 3rd line support där vi assisterar och genomför felsökning, databashantering och kodändringar när så behövs. Du har även ansvar för att ärenden som inkommer slussas vidare till systemutveckling när du ser behov för det. Vidare är du ett stöd till Hertz Produktägare i att acceptanstesta nyutveckling, dokumentera och implementera förändringarna vidare i organisationen. Ytterligare en del i rollen är att skapa funktionsspecifika utbildningar och manualer samt genomföra diverse systemutbildningar. \n\nVem är du?\n\nDu har stort fokus på service, systemtänk och tekniskt kunnande. Att du har erfarenhet av teknisk support sedan tidigare är en förutsättning för att kunna axla rollen och kunskaper i och erfarenhet av SQL och Linux är ett krav och du arbetar obehindrat med och i officepaketet.\n\nFör att trivas är du en lagspelare med ett stort intresse för att hjälpa andra, sätter alltid kunden i fokus och anstränger dig för att leverera lösningar. Du är kommunikativ och känner dig trygg i kontakten med både kunder och kollegor och du är lyhörd för att hitta optimala lösningar för kunden. Du har ett tekniskt intresse och är nyfiken inför nya utmaningar och ser det som en möjlighet till att lära dig någonting nytt. Du är en person med positiv inställning och har förmåga att driva ditt arbete framåt och agera snabbt när det behövs.\n\nDu är flytande i tal och skrift i något av de skandinaviska språken samt engelska. \n\nVad erbjuder vi?\n\nSom DevOps Medarbetare kommer du att ingå i ett härligt team och vi arbetar med ständiga förbättringar. Vi är marknadsledande och arbetar i en familjär miljö med hög servicekänsla, kundfokus och kreativitet. Vi tillhör Volvofamiljen och arbetar med innovativa lösningar med den senaste fordonstekniken. \n\nAtt det är människorna i organisationen som skapar Hertz Sveriges framgång vet vi och att sporra våra anställda till utveckling inom företaget är därför viktigt för oss. Hertz Sverige uppmuntrar och belönar goda prestationer och initiativ bland våra anställda. Här finns goda chanser till avancemang i en rolig atmosfär tillsammans med engagerade arbetskamrater. Som ett internationellt företag ligger det i vår natur att värna om mångfalden bland våra anställda samt att motverka alla former av diskriminering. \n\nVi ser helst att tjänsten är placerad i stockholm eller göteborg. \n\nÄr du intresserad?\n\nVi går igenom urvalet löpande, så se till att registrera din ansökan med personligt brev och CV så snart som möjligt. Vi ser fram emot att höra ifrån dig! Välkommen med din ansökan!\n\n\nHertz möter människors behov av rörelse med smarta mobilitetslösningar. Vi drivs av omtanke för våra kunder, människor och omvärlden.", "jobPublished": "Publicerad: 3 januari 2022, kl. 22.23" }, { "jobTitle": "Cloud DevOps Developer, Solna-Hybrid", "companyName": "PostNord Group ", "companyLocation": "Kommun: Stockholm", "jobDescription": "Join us! Be part of creating the digital customer experiences of the future with us.\n\nAt PostNord Digital we build customer solutions for the Nordic markets. A few examples of existing services and apps is PostNord Kundportal, Skicka Direkt, PostNord App and Riktiga Vykort. We have an open and positive environment where we share mistakes and knowledge to learn and improve our skills. We work agile in a DevOps culture, close with our customers and partners and with the latest techniques. The teams are self-sufficient, so you will have great opportuni-ties to influence the work and the technical choices.\n\nThe team seeking your knowledge is the API Governance Team.\n\nLearn more about PostNord Digital on https://www.linkedin.com/showcase/postnord-digital/.\n\n \n\nWe offer you\n\n - To work with our modern tech stack and you are given great opportunities to influence the choice of technology.\n - We encourage you to develop. For example, we sponsor you to AWS certify.\n - A job where the value you deliver is important to hundreds of thousands of users.\n - Wellness allowance & access to the office´s gym and indoor swimming pool.\n - Employee benefits through PostNord´s own personnel foundation PostNord Plus.\n - Great occupational pension terms.\n\n \n\nJob duties\n\nYou will be working in a cross functional team full of experts in API Management and JS/Typescript providing world class APIs to thousands of clients. As a DevOps developer you will be working with our API Platform used by our customers to integrate our APIs into their system. You will also be working with our digital Teams to help our colleagues to make things faster in their daily routines.\n\nYou will be responsible for the API Platform lifecycle management from beginning to end where you will work closely with your Product Owner or other business stakeholders and customers to discuss ideas. Then collaborate with teams from design and implementation perspective. There is also a possibility to build feature components within the delivery if that interest exists.\n\n\n \n\nWe are looking for you who have\n\nWe believe that you have experience of cloud DevOps, and a drive to perform some programming. The important thing is that you are a quick learner and have a passion to deliver value. You should also be familiar to work with infrastructural tasks and basic knowledge in any scripting language. You should not be afraid to contribute to make our delivery better, by adopting modern frameworks and innovative technologies. Fluent in English and/or Swedish.\n\n - Experience working with Cloud devops/sysops tasks.\n - Knowledge configuring ngnix proxy server. \n - Willing to learn programming/scripting.\n - Experience of CI/CD using bitbucket pipelines or similar.\n - Great communication and collaboration skills.\n - Familiar with node.js, NPM and private packages, Git and Bitbucket, AWS.\n - Team working in an Agile environment.\n\n \n\nWe make everyday life easier\n\nPostNord is the leading supplier of communication and logistics solutions to, from, and within the Nordic region. We ensure the provision of a postal service to households and businesses in Sweden and Denmark. We aim to make everyday life easier and more sustainable for everyone who lives and works in the Nordic region.\nWe are accountable, brave and committed, effectively leading change regardless if we lead our self or others. We emphasize teamwork, sincerity and positive relationships in the workplace. We build on our success and learn from both colleagues and mistakes. People with different backgrounds work with us. You will therefore be part of a workplace with great diversity, which contributes to better results for the business. Visit us at www.postnord.com\n\n \n\nApply\n\nWe look forward to receive your application! If you have any questions or concerns, you are welcome to contact Mikaela Englund, mailto:mikaela.englund@postnord.com.  \n\n\nFor union representatives, visit: https://www.postnord.com/sv/karriar/kontakt/facklig-kontakt\n\nWe are looking forward to hear from you! \n\n#LI-Hybrid #DevOps #Cloud", "jobPublished": "Publicerad: 26 januari 2022, kl. 10.31" }, { "jobTitle": "Senior AWS DevOps Engineer", "companyName": "Worldline Sweden AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "Worldline is the European leader in digital payments and number four worldwide, powered by over 20,000 employees in more than 50 countries. Every day, our technology provides the trusted infrastructure for millions of people and businesses around the world - and we´re just getting started. We are on an exciting journey to lead the way towards the next frontier of payments. Our ambitions are extraordinarily high, and we need the best people in the world to bring them to life – people like you. So if you are a highly skilled Senior AWS DevOps Engineer looking to make a real impact on the world, join our journey!The opportunityWe are looking for a versatile Senior AWS DevOps Engineer for our platform team, to work in a constantly evolving, dynamic, and agile environment, believing that the route to speed and stability is through automation. Teamwork, communication, and speaking your mind with respect to those around you are of high importance for us. A curious mind and willingness to grow and exchange your ideas and knowledge are highly welcome.In this role, you’ll set up AWS (Amazon Web Services) infrastructure in CloudFormation\\Terraform, building new quality Jenkins pipelines, to meet the development team's expectations regarding the services the team provides to other teams.The team consists of five people, who would love to work with you. Your team has a DevSecOps standpoint, owns, develops, and manages all Infrastructure as Code in AWS accounts, running 100s of VMs and containers; If you build it, you run it! Your day-to-day responsibilities includeLead complex projects and coach junior team membersDelivering the committed objectives that include adapting to any new needs to reach the goalSecuring an outstanding qualitative service availability 24/7/365 and a 3rd line on-call duty according to a rotating schedule.Participate in your team's day-to-day activities including software development, operations, maintenance, and supportBeing an active member in our agile events like daily stand-ups, planning, retros, demos. etc.Foster team spirit, quality and technical agility Signs of successYou are passionate about developing and operating large-scale cloud environments and services that bring value to your businessYou collaborate optimally with other team members and specialists.You are a role model by putting your team first and paying attention to dedication, accountability, and resultsYou are comfortable in a fast-paced environment, handling many different partners and prioritizations and a fast decision is not an issue for you Skills we can't do without:As our new Senior AWS DevOps Engineer, Minimum 3 years of proven experience in systems engineering, automating infrastructure creation & maintenance tasks using Docker, Jenkins, Terraform, CloudFormation, etc.Bachelor's or master's degree in computer science, engineering, or another meaningful fieldExperience in supporting/operating transaction driven and highly available platforms running microservices with 99.99% uptimeProven experience in AWS including DynamoDB, Lambdas, ECS, RDS, S3, Terraform, SAM/CloudFormationFundamental knowledge about Identity and Access Management in AWSExperience in deployment pipeline including Jenkins Pipeline and GIT, CI/CD, Release on DemandA deep understanding of software development principlesKnowledge of DevSecOps ways of working and culture including fostering the DevOps culture, automation, lean flow, measurement, and recoveryExperience in Key management and SSL certificatesImplementation experience with security solutions such as WAF, IDS/IPS, Anti-DDOS, and SIEMFull working proficiency in English Skills we'd like:It would be great if you have the following skills, too:Ability to act as an internal AWS solution architectAWS CertificationsDeveloping secure and/or PCI-DSS certified solutionsLog management Grow with us, create tomorrow At Worldline, we are dedicated to helping our people unlock their full potential - both professionally and personally. With comprehensive training and development programs, expert communities, and global mobility programs, you will always be able to develop and grow at Worldline - wherever you want to go and whatever you want to do. We also offer flexible hours and remote working, to empower you to be your best self at work and at home. 8 in 10 Worldliners consider Worldline a friendly place to work, and 9 in 10 are satisfied with the training & development they receive.Worldline is proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, colour, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as an individual with a disability, or other applicable legally protected characteristics.Learn more about life at Worldline on careers.worldline.com ", "jobPublished": "Publicerad: 20 januari 2022, kl. 08.37" }, { "jobTitle": "DevOps Engineer / SRE", "companyName": "Quickspin", "companyLocation": "Kommun: Stockholm", "jobDescription": "Quickspin is an online iGaming provider with the pursuit of creating the most thrilling experience ever. We also happen to be really awesome. To continue the success story of our new games platform, we’re now looking for a DevOps Engineer (specifically, SRE) to join the Platform team, on site in Stockholm.About the roleQuickspin is expanding its product portfolio with a newly acquired games platform. This platform is used to service all our major customers, delivering the games as well as reporting, configuration and monitoring of the gaming operation. The system is built using Java, Python and Ruby on Rails and its heavily dependent on MariaDB and Nginx. The platform itself is run in a mixed environment where some parts are hosted in the cloud and others will be run on virtual machines in VMware.In the role as a DevOps Engineer (also named Site Reliability Engineer, SRE) you will focus on reliability, network, and security to strengthen our team. The platform team is a multi-functional, agile team, that is responsible for both operating the systems as well as building new exciting features towards our long list of highly successful customers. With colleagues in both Sweden, Ukraine and Poland, you will be a part of a diverse and cross-collaborating team which demands excellent online communication and English skills. The SRE will among others be; Developing the next generation of CICD, Troubleshooting Platform issues, Developing new observability points, Building tools to automate and enhance the platform, & Supporting developers and 2nd line support. Quickspin is a casual and playful place to work, where the pace is high and all voices matter.What we are looking for:+1 years of experience in hands-on working with Linux systems administration in DevOps environmentGood understanding of networking, web protocols, services, applications and their performance requirements (Websocket, HTTP protocol, SSL, DNS, TCP/IP etc.)Some experience of Network security, configurations of load balancers and Firewalls in an Opensource as well as cloud environmentSome experience with infrastructure automation/configuration management using tools such as AnsibleBasic programming skills in Python/Bash/go scripting languagesHands-on experience with troubleshooting and root cause analysisFamiliar with standard software development and quality processes, methodologies and toolsVery good command of EnglishBonus points for...Experience with log processing and metrics collection (loki/prometheus/Grafana)Knowledge of GitOpsExperience with AWS (EC2, EKS)Experience with DockerExperience with MariaDB/MySQLKnowledge of Java or Ruby on RailsWho are you and what we offerWe are seeking a structured yet creative person, who does not settle and is always eager to learn and develop new things. You understand and embrace good development practices such as code reviews, test automation and you take pride in writing code that is easy to test, read and maintain. You love backwards compatibility. We go by the vision of “We create Awesomeness” and that goes with everything we do - From creating a great work environment together to making thrilling games. Life at Quickspin simply never gets boring – and it won’t take long until it really feels like home. You will be surrounded by kind, corny, and simply put - awesome people - that are truly passionate about what they do. We are also proud to say that we offer an excellent package, flexible hours and of course, a challenging and rewarding job in one of the fastest growing and most exciting industries there is.Interested?", "jobPublished": "Publicerad: 19 januari 2022, kl. 13.45" }, { "jobTitle": "Infrastructure and DevOps engineer", "companyName": "Rebtel Networks AB", "companyLocation": "Kommun: Stockholm", "jobDescription": "Global migration is a 21st-century reality: Whether people are fleeing from something or racing towards better opportunity, finding love, or looking to experience new cultures, people are now living side by side in a new way. At Rebtel, we believe in tearing down borders – from the geographical borders that complicate international communication and money transfers to the cultural borders that keep people divided. We’re on a mission to build products serving the 2 billion modern internationals of the world. We offer work, communication, and remittance services for anyone that has crossed a border:\nOur team mirrors our global audience:  we are a diverse team of people from 20 different countries that get together everyday – and we’d love for you to join us. Do you have what it takes?\n \nRebtel is looking for an Infrastructure & DevOps Engineer\nAbout Rebtel’s infrastructure\nOur infrastructure is entirely cloud-based and we have components in the 3 major cloud environments (AWS, Azure, GCP). Our infrastructure hosts our customer-facing business applications as well as support systems used internally by different teams. Given how long we have been around, we have some legacy applications and systems that run on VMs in the cloud, but our preference is for containerization orchestrated by Kubernetes.\nIn an environment as vast as Rebtel’s, it is important to maintain thorough documentation of our systems, but even better to persist our infrastructure as code using modern tools such as Terraform. Our work approach is well structured without being stifling. We use an agile workflow to handle day to day tasks. We strongly encourage collaboration as an excellent way to spread knowledge and to deliver universally relevant products and services.\nGiven our fast-paced journey and market ambition, you will find tasks that are demanding and that will trigger your creativity. At Rebtel, everyone contributes to our customer propositions - we have quick communication channels between teams and have regular hackathons to respond to opportunities and challenges as they come.\nRebtel is looking for a DevOps and Infrastructure engineer to join its team that is building new products and services in a modern, cloud-based ecosystem.\nAbout you and your responsibilities\n\nWe’re looking for an individual who we can learn from and help us take our infrastructure to the next level.\nWe love to share the knowledge we have and to learn new things from you.\nYou have keen interest in architecture: how to build complex systems that are maintainable.\nAs an Infrastructure and devops engineer, your role will include actively contributing towards architectural decisions. You will discuss technical solutions with the rest of the team and act as an inspiration to improve and maintain system stability, availability, and security.\nYou are interested in problem solving and enjoy finding the simplest possible solution to complex problems.\nYou work well with teams, even in areas besides DevOps and infrastructure, but are also capable of performing as a sole contributor in your area\n\nRequirements\n\nExperience with Azure and, preferably, also with GCP and AWS.\nSound knowledge of networking principles and common concepts such as firewalls, load balancers and application gateways and debugging tools such as Wireshark.\nGood understanding of containerization using Docker and Kubernetes\nExperience setting up CI/CD pipelines using common tools deployment tools (GIT, Azure Devops, Teamcity, Octopus)\nExperience with infrastructure-as-code tools such as Terraform and Ansible\nExperience with system administration on both Windows and *nix based platforms including scripting using Powershell and Shell.\nExcellent communication skills in English\n\nBonus points\n\nKnowledge of IP telephony and related technologies/protocols such as SIP, WebRTC.\nExperience writing and automating system tests\nExperience working with cross functional teams on mature products with many users\nExperience working with standards for compliance in the payments industry e.g PCI\n\nIdeal candidate\n\n3+ years full-time professional experience (i.e., 6k+ hours)\nCommitted to documenting and automating routine tasks\nRaise the level of everyone around you\nHappy hacking on new technology, loves R&D\nAlways curious, always learning\nVision for product development and for how a code base evolves\nA pleasure to work with\n\n \nWe are Rebtel. People from all around the world, as of now 20 countries and more to come. We believe in equal opportunity and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "jobPublished": "Publicerad: 12 januari 2022, kl. 09.58" }, { "jobTitle": "Devops ingenjör till Handelsbanken", "companyName": "Nexer Recruit", "companyLocation": "Kommun: Stockholm", "jobDescription": "Handelsbanken är ett företag med en stark tro på den enskilda individens förmåga och kan erbjuda dig utmaningar och möjligheter att utvecklas i ett företag som befinner sig mitt i en spännande digitaliseringsresa. Just nu söker vi dig med stort IT-intresse som vill joina oss under denna resa. Din främsta uppgift är att effektivisera utvecklarnas vardag. Så om du drivs av att göra livet enklare för andra är detta uppdrag just för dig.  \n\nDin vardag\n\nPå avdelningen för IT-styrning ansvarar vi bland annat för applikationsramverk och utvecklarstöd och arbetar dagligen med att effektivisera och förbättra IT-leveransen. I dagsläget består området 4 team som jobbar agilt och tvärfunktionellt med omväxlande och intressanta uppgifter.\n\nDu kommer att ingå i vårt Devops Toolchain team som ansvarar för bankens CI/CD plattformar där du kommer ha en ledande roll och tar ett stort ansvar för våra leveranser och bidrar med kunskap och engagemang genom hela processen.\n\nVem är du\n\nFör att lyckas i din roll ser vi det som krav att du har dessa kompetenser i bagaget:\n\n\n• Kunskaper inom DevOps Toolchains (provat på olika CI/CD verktyg)\n• Stor erfarenhet av Linux\n• Erfarenhet av verktyg som UrbanCode Deploy, Ansible, TeamCity eller andra typer av deploy verktyg\n• Goda kunskaper om pipelines för build och deploy processer\n• Erfarenhet av Git\n• Kommunicera på svenska och engelska på en professionell nivå\n• Har en akademisk utbildning som Systemvetare, civil ingenjör eller annan relevant bakgrund\n\n Det är även meriterande att du är intresserad av IT-säkerhet och nätverk\n\nFör att trivas hos oss och känna att du har hamnat hos likasinnade människor är det viktigt att du är positiv och mån om vilken energi du tar med dig till jobbet. Du är lösningsorienterad och har förmågan att hitta nya vägar framåt. Du är generös med att dela med dig av dina kunskaper och erfarenheter så ni som grupp blir starkare och smartare tillsammans. Du har lätt för att kommunicera ut komplexitet på ett förenklat sätt. Sist med inte minst ansvarstagande!\n\nVill du veta mer\n\nI den här rekryteringen samarbetar vi med Nexer Recruit. Vill du veta mer, kontakta rekryteringskonsulten via markus.hanna@nexergroup.com alternativt via mobil på +46 730 31 15 81.\n\nVälkommen med din ansökan på www.nexerrecruit.com/jobb. Då urval och intervjuer sker löpande ber vi dig skicka din ansökan så snart som möjligt.\n\nOm Handelsbanken\n Den personliga kontakten mellan människor är utgångspunkten för lyckade bankaffärer. Tycker vi. Det har vi tyckt sedan 1871, när banken grundades. De goda relationerna är förmodligen anledningen till att vi fortsätter vara en stabil bank år efter år, med framgångsrika affärer och nöjda kunder. Som medarbetare i Handelsbanken finns stora möjligheter att utvecklas åt det håll som intresserar dig mest – oavsett om du vill bli rådgivare, chef, specialist eller satsa på en internationell karriär. Välkommen till en bank med lång erfarenhet i branschen.", "jobPublished": "Publicerad: 10 januari 2022, kl. 11.10" }, { "jobTitle": "DevOps Engineer till IT-Total", "companyName": "IT-Total Sweden AB", "companyLocation": "Kommun: Solna", "jobDescription": "Vill du jobba med ett vinnande team?Vi på IT-Total är ett vinnande IT-bolag som växer så det knakar. Tillsammans arbetar vi med att leverera de bästa lösningarna för våra kunder. I våra olika uppdrag använder vi de modernaste teknikerna och har de roligaste projekten. Vi har både interna projekt samt externa uppdrag och vi arbetar med allt från strategi, implementation och utveckling.Om tjänstenÄr du ett proffs som brinner för att skapa nytta kommer du att ha det väldigt bra på IT-Total. Nu behöver vi förstärka vårt DevOps Team med en till specialist som kan agera expert i våra olika interna och externa projekt. Våra projekt rör sig inom bland annat Cloud and Automation och vi gör allt från förändringsarbete till att förbättra och vidareutveckla kundens befintliga miljö. Vi utvecklar anpassade system med moderna lösningar som hjälper oss och våra kunder att arbeta smartare. IT-Total vill jobba med de bästa i branschen och vi är ett stort gäng specialister där det finns mycket i utbyte på en avancerad nivå.Vad krävs för att lyckas i rollen?Erfarenhet av att automatisera installationen av Cloud Infrastructure, du brinner för att bygga zero touch system.Erfarenhet av att bygga stabila och skalbara Cloud lösningar.Goda erfarenheter inom en eller flera Cloud teknologier Azure, AWS eller GCP.Goda erfarenheter av att utveckla Machine Learning lösningar.Hands-on erfarenheter av att arbeta med Micro-services/containers (Docker, Kubernetes etc.).Erfarenhet av infrastrukturhantering och DevOps. Expert på verktyg som Terraform, Ansible, Jenkins / Travis / GitLab CI, etc.Erfarenhet av agilt arbetssätt och är villig att ta olika typer av arbetsuppgifter för att uppfylla leveransen.Mycket goda kunskaper i svenska och engelska, både i tal och skrift.Meriterande:Certifieringar, men självklart kan vi hjälpa dig på vägen.Erfarenhet av Hybrid Cloud Security lösningar.Erfarenhet inom C#, .Net eller andra programmeringsspråk.Varför kommer du att trivas på IT-TotalVi vill att du ska få goda förtjänstvillkor och frihet att styra din egen utveckling och ditt eget arbete. Utöver att vi är en bra arbetsplats med fantastiska medarbetare så är vi ett mycket aktivt gäng som gör saker tillsammans, när pandemin tillåter. Vi tror på teamkänsla och en stark personlig utveckling.Vi är en innovativ arbetsgivare som satsar på framtiden och jobbar i teknikens framkant. Hos oss omges du av kollegor som är bland de vassaste i branschen inom IT-infrastruktur och Cybersäkerhet. Vår kultur är något vi är mycket stolta över och som har kännetecknat oss sedan start. Vi lever efter våra kärnvärden som genomsyrar allt vi gör: Gemenskap, Engagemang, Kompetens, Kvalité och Omtanke.Varmt välkommen med din ansökan!", "jobPublished": "Publicerad: 29 december 2021, kl. 16.11" }, { "jobTitle": "DevOps Engineer to Swedbank", "companyName": "Swedbank AB (publ)", "companyLocation": "Kommun: Sundbyberg", "jobDescription": "Are you passionate about DevOps and Infra automation? Then the key-role as DevOps Engineer to Swedbank’s team “Pega CoE” might be the right next step for you.You will lead the DevOps journey for the Pega application, help building Continuous Delivery pipelines, improve the area of test automation and achieve Software-Defined Everything (SDx). The Pega platform is a central platform in several business-critical areas at Swedbank and you will have many contact areas all over the organization. Sounds interesting? Read more, contact us and/or apply today!The RoleIn this role as DevOps Engineer you will be part of an experienced team – the Pega Centre of Excellence (CoE) team at Swedbank. The team consists of Architects, Infrastructure Engineers and DevOps Engineers. As DevOps Engineer, you will play a central role in the prioritized and strategic vision for Swedbank overall.Your will get the opportunity to: \tDeliver platform services and expertise guidance to the development teams.\tSecuring a stable platform by proactive drive development, monitoring, configuring and troubleshooting of the Pega platform.\tBe responsible for development and lifecycle of the Pega DevOps pipelines.\tAct as a consultant for questions in DevOps and cloud strategy.\tCollaborate with external vendor (Pegasystems) to taking the next step for the DevOps journey.You will work across seven business areas and be part of leading the DevOps journey for the Pega application(s). It is a great opportunity to get to know many different parts of the bank and to continuously get personal as well as technical development. You will be placed at Swedbank’s HQ in Sundbyberg.Is this you?To be successful in this role, we believe that you have: \tExperience from working as a DevOps Engineer, in a leading position\tStrong knowledge of infrastructure\tExtensive experience in SW development life cycle\tStrong knowledge of DevOps technology, such as: RHEL, Java, Docker, Kubernetes, Openshift, Ansible, Puppet, GIT, etc.\tDeep understanding of application structure including hardware and integrations to systemsKnowledge on cloud technologies like Azure and AWS are meritorious. Experience from working with a BPM tool is not mandatory but also an advantage.Personality wise, it is important that you have great communication skills as you will be in contact with many different departments internally as well as external consultants and vendors. It is important that you are pedagogic and comfortable in facilitating workshops. You are a true team-player who gets energy of achieving common goals but are also self-driven and used to take own initiatives. You are curious and driven by learning new things and to develop.Do you want to know more?In this process Swedbank is working with Level Recruitment. To apply, please click at the apply button. If you have any questions please contact Daniel Stenberg at 08-120 50 429, or Daniel.stenberg@levelrecruitment.se.", "jobPublished": "Publicerad: 23 december 2021, kl. 10.52" }, { "jobTitle": "Molnexpert - DevOps Specialist", "companyName": "Bonnier News", "companyLocation": "Kommun: Stockholm", "jobDescription": "Vill du jobba i ett självstyrande team med moderna tekniker och nära samarbete med andra utvecklingsteam? Brinner du för att vara med och utveckla produkter som gör skillnad för demokratin, samhället och det fria ordet? Då kommer du att trivas på Bonnier News – Sveriges största mediehus där vi nu tar nästa steg i att skapa morgondagens journalistik.\n\nVi är i en spännande fas där vi lägger grunden för den framtida driften av de tekniska plattformarna till Bonnier News många kända varumärken. Tyngdpunkten ligger i att bygga upp infrastruktur i Googles molnplattform. Kopplat till detta så söker vi en DevOps-expert som vill vara med och bygga en av Mediesveriges mest moderna och progressiva utvecklingsorganisationer. \n\nOm teamet:\n\nDu kommer vara en del av ett engagerat team som stöttar de olika utvecklingsteamen inom Bonnier News Tech gällande användning av molntjänster, CDN och annan infrastruktur. I rollen kommer du jobba nära våra DevOps-specialister och utvecklare samt övriga team-medlemmar som är placerade i Stockholm och Mellerud. Du kan räkna med visst distansarbete, men du bör kunna vara på plats 2-3 dagar per vecka.\n\nVi jobbar mycket med, och värdesätter, samarbete. Både inom teamet och i olika samarbeten med varumärkenas utvecklingsteam. Detta tar sig ofta uttryck i par-/mobbprogrammering, inte sällan över teamgränserna. På så sätt är vi både stöd till utvecklingsteamen och har inflytande på teknikval, strukturer och best practices.\n\nNågra av de vanligaste teknikerna hos oss i dagsläget:\n\n - \nDocker.\n\n - \nKubernetes, speciellt Openshift.\n\n - \nTjänster inom GCP, men även AWS.\n\n - \nElasticsearch, MongoDB, Redis, PostgreSQL.\n\n - \nNodeJS och Golang.\n\n\nDin erfarenhet:\n\nVi söker dig som har jobbat med några av de ovan nämnda tekniker, gärna med fokus på infrastruktur och DevOps. Du är prestigelös och gillar att samarbeta med andra i autonoma team. Bonnier News jobbar målmedvetet med frågor som berör mångfald och vill ta tillvara de kvaliteter som det tillför verksamheten. Vi värdesätter också engagemang i den digital transformation som vi befinner oss i för att göra vår journalistik och våra tjänster ännu mer tillgängliga för ännu fler.\n\nÖvrig information\n\nBonnier News Tech har tre hubbar; Stockholm, Sundsvall och Malmö. I den här rollen har du möjlighet att jobba på den plats, av dessa tre som passar dig bäst. Rollen rapporterar till Fabian Seitz, chef digitala utvecklingsplattformar. \n\nUrvalet till den här tjänsten sker löpande, så skicka in din ansökan så snart som möjligt genom att trycka på ansök-knappen nedan. Med anledning av GDPR har vi inte möjlighet att ta emot ansökningar via email. \n\nVi ser fram emot din ansökan, hoppas vi hörs! \n\n\nInom Bonnier News värnar vi om det fria ordet och gör skillnad genom journalistik som når och berör många. Vi är Sveriges ledande mediehus med varumärken som Dagens Nyheter, Expressen och Dagens industri når vi miljoner läsare och användare varje dag. Genom Bonnier News Local har vi även ett stort lokalt engagemang - från Sydsvenskan i söder till Örnsköldsviks Allehanda i norr. Förutom detta ger vi också ut branschspecifika tidningar såsom Dagens Media, Resumé, Dagens medicin och Fastighetsnytt, och även en rad livsstilsmagasin som Damernas Värld, Sköna Hem, Teknikens Värld och Allt om Mat m.fl. Genom att ständigt driva den digitala utvecklingen framåt når vi hela tiden längre - som medarbetare hos oss kan du påverka riktningen.", "jobPublished": "Publicerad: 21 december 2021, kl. 13.02" }, { "jobTitle": "Molnexpert - DevOps Specialist", "companyName": "Bonnier News", "companyLocation": "Kommun: Stockholm", "jobDescription": "Vill du jobba i ett självstyrande team med moderna tekniker och nära samarbete med andra utvecklingsteam? Brinner du för att vara med och utveckla produkter som gör skillnad för demokratin, samhället och det fria ordet? Då kommer du att trivas på Bonnier News – Sveriges största mediehus där vi nu tar nästa steg i att skapa morgondagens journalistik.\n\nVi är i en spännande fas där vi lägger grunden för den framtida driften av de tekniska plattformarna till Bonnier News många kända varumärken. Tyngdpunkten ligger i att bygga upp infrastruktur i Googles molnplattform. Kopplat till detta så söker vi en DevOps-expert som vill vara med och bygga en av Mediesveriges mest moderna och progressiva utvecklingsorganisationer. \n\nOm teamet:\n\nDu kommer vara en del av ett engagerat team som stöttar de olika utvecklingsteamen inom Bonnier News Tech gällande användning av molntjänster, CDN och annan infrastruktur. I rollen kommer du jobba nära våra DevOps-specialister och utvecklare samt övriga team-medlemmar som är placerade i Stockholm och Mellerud. Du kan räkna med visst distansarbete, men du bör kunna vara på plats 2-3 dagar per vecka.\n\nVi jobbar mycket med, och värdesätter, samarbete. Både inom teamet och i olika samarbeten med varumärkenas utvecklingsteam. Detta tar sig ofta uttryck i par-/mobbprogrammering, inte sällan över teamgränserna. På så sätt är vi både stöd till utvecklingsteamen och har inflytande på teknikval, strukturer och best practices.\n\nNågra av de vanligaste teknikerna hos oss i dagsläget:\n\n - \nDocker.\n\n - \nKubernetes, speciellt Openshift.\n\n - \nTjänster inom GCP, men även AWS.\n\n - \nElasticsearch, MongoDB, Redis, PostgreSQL.\n\n - \nNodeJS och Golang.\n\n\nDin erfarenhet:\n\nVi söker dig som har jobbat med några av de ovan nämnda tekniker, gärna med fokus på infrastruktur och DevOps. Du är prestigelös och gillar att samarbeta med andra i autonoma team. Bonnier News vill ta tillvara de kvaliteter som en jämn könsfördelning samt etnisk och kulturell mångfald tillför verksamheten.\n\nÖvrig information\n\nBonnier News Tech har tre hubbar; Stockholm, Sundsvall och Malmö. I den här rollen har du möjlighet att jobba på den plats, av dessa tre som passar dig bäst. Rollen rapporterar till Fabian Seitz, chef digitala utvecklingsplattformar. \n\nUrvalet till den här tjänsten sker löpande, så skicka in din ansökan så snart som möjligt genom att trycka på ansök-knappen nedan. Med anledning av GDPR har vi inte möjlighet att ta emot ansökningar via email. \n\nVi ser fram emot din ansökan, hoppas vi hörs! \n\n\nInom Bonnier News värnar vi om det fria ordet och gör skillnad genom journalistik som når och berör många. Vi är Sveriges ledande mediehus med varumärken som Dagens Nyheter, Expressen och Dagens industri når vi miljoner läsare och användare varje dag. Genom Bonnier News Local har vi även ett stort lokalt engagemang - från Sydsvenskan i söder till Örnsköldsviks Allehanda i norr. Förutom detta ger vi också ut branschspecifika tidningar såsom Dagens Media, Resumé, Dagens medicin och Fastighetsnytt, och även en rad livsstilsmagasin som Damernas Värld, Sköna Hem, Teknikens Värld och Allt om Mat m.fl. Genom att ständigt driva den digitala utvecklingen framåt når vi hela tiden längre - som medarbetare hos oss kan du påverka riktningen.", "jobPublished": "Publicerad: 10 december 2021, kl. 14.23" }, { "jobTitle": "DevOps Engineer till Swish", "companyName": "STACC", "companyLocation": "Kommun: Stockholm", "jobDescription": "Swish lanserades 2012 och har sedan dess blivit hela Sveriges mobila betalapp och en av de största mobila betalningslösningarna i Europa. Bolaget Getswish ansvarar för Swish infrastruktur, tjänster, dess regelverk samt varumärket Swish. Swish har cirka 25 medarbetare och har sitt kontor i centrala Stockholm. Deras tjänster möjliggör betalningar mellan privatpersoner, till företag både för e-handel och i fysiska miljö. Den senaste tjänsten möjliggör även utbetalningar från företag till privatpersoner.\n\n\n\nNuvarande situation och resa framåt:\nVi satsar nu på att ytterligare förenkla vardagen för våra kunder och användare. Det blir en tuff, men superintressant resa att transformera både vår nuvarande on-problemlösning till cloud OCH bygga upp en egen IT-organisation. De kommande åren ska vi gå från en helt outsourcad leverans till att sätta oss i förarsätet. Tillsammans med våra leverantörer ska vi göra en resa från traditionell utveckling-förvaltning-drift till en verklighet där vi arbetar enligt DevOps-practice i GCP. Denna transformation blir en balansakt eftersom Swish dels ska klara av att skala affären, bära nya tjänster och fortfarande tillhandahålla en tillgänglig och stabil tjänst 24/7.\n\nNu söker söker vi en DevOps-engineer som känner sig hemma i att arbeta med Terraform, GCP, Kubernetes och där hela rasket hanteras i Git! Har du dessutom erfarenhet av att hantera transaktionsintensiva distribuerade system och alla de utmaningar som döljer sig när ett sådant system körs på en microservices-arkitektur så är det ett stort plus. Du kommer vara involverad med systemet i alla dess livscykler; från att arbeta med att utveckla våra CI/CD-pipelines för både infrastrukturen och applikationen till att definiera monitors och dashboards för övervakningen.\n\nDu tror precis som vi att DevOps-metodiken, dvs att teamet gemensamt äger sin del av systemet från design till övervakning, är sättet att skapa effektivitet genom helhetsägande och minimering av överlämningsoverhead. Du tar ansvar genom att du bidrar till ett system som gör att hela teamet, inte bara du, kan gå hem för dagen och vara trygg i att systemet rullar på som det ska. Om något ändå blir fel i systemet ska det vara så transparent att alla i teamet ska kunna förstå och i bästa fall åtgärda problemet.\n\n\n\nMer konkret vill vi komplettera vårt team med dig som känner att listan nedan stämmer bra överens med dig och vad du kan bidra med.\n\nVi söker dig som har:\n\n- Relevant teknisk högskoleutbildning eller motsvarande och minst 5 års erfarenhet av DevOps-utveckling.\n- Erfarenhet av Infrastructure as Code/Terraform, Kubernetes och CI/CD-pipelines (gärna Gitlab CI/CD).\n- Minst 2 års erfarenhet av modern molninfrastruktur (helst GCP).\n- Känner dig bekväm med befintlig tech-stack: Java, Spring Boot, Spring Cloud, web services and RESTful API’s.\n- Meriterande med kompetens inom SecOps och cloudsäkerhet (gärna Cloud Armor, Hashicorp Vault, Google Secret Manager).\n- Meriterande med kompetens inom uppsättning av monitorering och instrumentering av tjänster (Gärna arbetat med Prometheus, Grafana, Dynatrace eller Datadog).\n- Är intresserad av omvärlden och hur man bygger bästa möjliga tekniska lösning för ett bolag i snabb tillväxt.\n- Ett analytiskt tänkande och god problemlösningsförmåga.\n- Van vid ett agilt arbetssätt och god kommunikativ förmåga, både verbalt och i skrift (helst svensktalande)\n\n\n\n\n\n\nVi ser fram emot din ansökan!", "jobPublished": "Publicerad: 14 oktober 2021, kl. 09.54" }]